-- Додавання підрозділів
INSERT INTO Units (unit_name, unit_location) VALUES
('1-ша окрема танкова бригада', 'Чернігів'),
('72-га окрема механізована бригада', 'Біла Церква'),
('93-тя окрема механізована бригада', 'Черкаське');

-- Додавання операцій
INSERT INTO Operations (operation_name, start_date, end_date, operation_status) VALUES
('Операція "Звільнення"', '2023-11-15', '2023-11-25', 'Завершено'),
('Операція "Оборона"', '2023-12-01', NULL, 'Виконується'),
('Операція "Контрнаступ"', '2024-01-10', NULL, 'Заплановано');

-- Додавання звітів
INSERT INTO Reports (report_date, description, operation_id) VALUES
('2023-11-20', 'Звіт про хід операції "Звільнення". Втрати: 2 танки, 5 осіб.', 1),
('2023-11-26', 'Підсумковий звіт операції "Звільнення".', 1),
('2023-12-05', 'Звіт про стан оборони.', 2);

-- Додавання зв'язків між підрозділами та операціями
INSERT INTO Units_Operations (unit_id, operation_id) VALUES
(1, 1),
(2, 1),
(2, 2),
(3, 3);